       FD CLIENTES.

       01 CLIENTES-CLI.
           05 CLI-KEY.
              10 CLI-CNPJ   PIC 9(014).
           05 CLI-COD       PIC 9(007).
           05 CLI-NOME      PIC X(040).
           05 CLI-LATIT     PIC S9(003)V9(008).
           05 CLI-LONGI     PIC S9(003)V9(008).
           05 CLI-VEND      PIC  9(003).