       FD VENDEDOR.

       01 VENDEDOR-REG.
           05 VEN-KEY.
              10 VEN-CPF    PIC 9(011).
           05 VEN-COD       PIC 9(003).
           05 VEN-NOME      PIC X(040).
           05 VEN-LATIT     PIC S9(003)V9(008).
           05 VEN-LONGI     PIC S9(003)V9(008).
