           01  LK-PARAMETROS.
               05 LK-LATITUDE-C        PIC S9(03)V9(08).
               05 LK-LATITUDE-V        PIC S9(03)V9(08).
               05 LK-LONGITUDE-C       PIC S9(03)V9(08).
               05 LK-LONGITUDE-V       PIC S9(03)V9(08).
               05 LK-DISTANCIA         PIC 9(05)V9999.
               05 LK-STATUS-RET        PIC X.
               05 LK-MENSAGEM          PIC X(30).
