       01  LK-FILE-STATUS.
           05 LK-PRG        PIC X(08).
           05 LK-ARQ        PIC X(08).
           05 LK-CMD        PIC X(08).
           05 LK-PAR        PIC X(30).
           05 LK-STA        PIC X(02).
           05 LK-RET        PIC X(02).
           05 LK-MSG        PIC X(40).
